tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1575_tdd.h
#define PWM1PHH_PH                    522
#define PWM1PHH1                      523
#define PWM1PHH2                      524
#define PWM1PHH3                      525
#define PWM1PHH4                      526
#define PWM1PHH5                      527
#define PWM1PHH6                      528
#define PWM1PHH7                      529
#define PWM1DCL_DC                    530
#define PWM1DCL                       531
#define PWM1DCL0                      532
#define PWM1DCL1                      533
#define PWM1DCL2                      534
#define PWM1DCL3                      535
#define PWM1DCL4                      536
#define PWM1DCL5                      537
#define PWM1DCL6                      538
#define PWM1DCL7                      539
#define PWM1DCH_DC                    540
#define PWM1DCH                       541
#define PWM1DCH0                      542
#define PWM1DCH1                      543
#define PWM1DCH2                      544
#define PWM1DCH3                      545
#define PWM1DCH4                      546
#define PWM1DCH5                      547
#define PWM1DCH6                      548
#define PWM1DCH7                      549
#define PWM1PRL                       550
#define PWM1PRL0                      551
#define PWM1PRL_PR                    552
#define PWM1PRL1                      553
#define PWM1PRL2                      554
#define PWM1PRL3                      555
#define PWM1PRL4                      556
#define PWM1PRL5                      557
#define PWM1PRL6                      558
#define PWM1PRL7                      559
#define PWM1PRH                       560
#define PWM1PRH_PR                    561
#define PWM1PRH0                      562
#define PWM1PRH1                      563
#define PWM1PRH2                      564
#define PWM1PRH3                      565
#define PWM1PRH4                      566
#define PWM1PRH5                      567
#define PWM1PRH6                      568
#define PWM1PRH7                      569
#define PWM1OFL0                      570
#define PWM1OFL_OF                    571
#define PWM1OFL                       572
#define PWM1OFL1                      573
#define PWM1OFL2                      574
#define PWM1OFL3                      575
#define PWM1OFL4                      576
#define PWM1OFL5                      577
#define PWM1OFL6                      578
#define PWM1OFL7                      579
#define PWM1OFH_OF                    580
#define PWM1OFH                       581
#define PWM1OFH0                      582
#define PWM1OFH1                      583
#define PWM1OFH2                      584
#define PWM1OFH3                      585
#define PWM1OFH4                      586
#define PWM1OFH5                      587
#define PWM1OFH6                      588
#define PWM1OFH7                      589
#define PWM1TMRL0                     590
#define PWM1TMRL_TMR                  591
#define PWM1TMRL                      592
#define PWM1TMRL1                     593
#define PWM1TMRL2                     594
#define PWM1TMRL3                     595
#define PWM1TMRL4                     596
#define PWM1TMRL5                     597
#define PWM1TMRL6                     598
#define PWM1TMRL7                     599
#define PWM1TMRH                      600
#define PWM1TMRH0                     601
#define PWM1TMRH_TMR                  602
#define PWM1TMRH1                     603
#define PWM1TMRH2                     604
#define PWM1TMRH3                     605
#define PWM1TMRH4                     606
#define PWM1TMRH5                     607
#define PWM1TMRH6                     608
#define PWM1TMRH7                     609
#define PWM1CON                       610
#define PWM1CON_MODE                  611
#define PWM1MODE0                     612
#define PWM1MODE                      613
#define PWM1CON_MODE0                 614
#define PWM1MODE1                     615
#define PWM1CON_MODE1                 616
#define PWM1CON_POL                   617
#define PWM1POL                       618
#define PWM1CON_OUT                   619
#define PWM1OUT                       620
#define PWM1OE                        621
#define PWM1CON_OE                    622
#define PWM1EN                        623
#define PWM1CON_EN                    624
#define PWM1INTE                      625
#define PWM1PRIE                      626
#define PWM1INTE_PRIE                 627
#define PWM1DCIE                      628
#define PWM1INTE_DCIE                 629
#define PWM1INTE_PHIE                 630
#define PWM1PHIE                      631
#define PWM1OFIE                      632
#define PWM1INTE_OFIE                 633
#define PWM1INTF                      634
#define PWM1INTF_PRIF                 635
#define PWM1PRIF                      636
#define PWM1INTF_DCIF                 637
#define PWM1DCIF                      638
#define PWM1PHIF                      639
#define PWM1INTF_PHIF                 640
#define PWM1OFIF                      641
#define PWM1INTF_OFIF                 642
#define PWM1CLKCON                    643
#define PWM1CLKCON_CS                 644
#define PWM1CS                        645
#define PWM1CLKCON_CS0                646
#define PWM1CS0                       647
#define PWM1CLKCON_CS1                648
#define PWM1CS1                       649
#define PWM1CLKCON_PS0                650
#define PWM1PS                        651
#define PWM1PS0                       652
#define PWM1CLKCON_PS                 653
#define PWM1PS1                       654
#define PWM1CLKCON_PS1                655
#define PWM1PS2                       656
#define PWM1CLKCON_PS2                657
#define PWM1LDCON                     658
#define PWM1LDCON_LDS0                659
#define PWM1LDS                       660
#define PWM1LDCON_LDS                 661
#define PWM1LDS0                      662
#define PWM1LDCON_LDS1                663
#define PWM1LDS1                      664
#define PWM1LDCON_LDT                 665
#define PWM1LDM                       666
#define PWM1LD                        667
#define PWM1LDCON_LDA                 668
#define PWM1OFCON                     669
#define PWM1OFCON_OFS0                670
#define PWM1OFS                       671
#define PWM1OFCON_OFS                 672
#define PWM1OFS0                      673
#define PWM1OFCON_OFS1                674
#define PWM1OFS1                      675
#define PWM1OFMC                      676
#define PWM1OFCON_OFO                 677
#define PWM1OFM0                      678
#define PWM1OFM                       679
#define PWM1OFCON_OFM0                680
#define PWM1OFCON_OFM                 681
#define PWM1OFM1                      682
#define PWM1OFCON_OFM1                683
#define PWM2PHL_PH                    684
#define PWM2PHL0                      685
#define PWM2PHL                       686
#define PWM2PHL1                      687
#define PWM2PHL2                      688
#define PWM2PHL3                      689
#define PWM2PHL4                      690
#define PWM2PHL5                      691
#define PWM2PHL6                      692
#define PWM2PHL7                      693
#define PWM2PHH0                      694
#define PWM2PHH                       695
#define PWM2PHH_PH                    696
#define PWM2PHH1                      697
#define PWM2PHH2                      698
#define PWM2PHH3                      699
#define PWM2PHH4                      700
#define PWM2PHH5                      701
#define PWM2PHH6                      702
#define PWM2PHH7                      703
#define PWM2DCL_DC                    704
#define PWM2DCL0                      705
#define PWM2DCL                       706
#define PWM2DCL1                      707
#define PWM2DCL2                      708
#define PWM2DCL3                      709
#define PWM2DCL4                      710
#define PWM2DCL5                      711
#define PWM2DCL6                      712
#define PWM2DCL7                      713
#define PWM2DCH0                      714
#define PWM2DCH_DC                    715
#define PWM2DCH                       716
#define PWM2DCH1                      717
#define PWM2DCH2                      718
#define PWM2DCH3                      719
#define PWM2DCH4                      720
#define PWM2DCH5                      721
#define PWM2DCH6                      722
#define PWM2DCH7                      723
#define PWM2PRL0                      724
#define PWM2PRL_PR                    725
#define PWM2PRL                       726
#define PWM2PRL1                      727
#define PWM2PRL2                      728
#define PWM2PRL3                      729
#define PWM2PRL4                      730
#define PWM2PRL5                      731
#define PWM2PRL6                      732
#define PWM2PRL7                      733
#define PWM2PRH0                      734
#define PWM2PRH                       735
#define PWM2PRH_PR                    736
#define PWM2PRH1                      737
#define PWM2PRH2                      738
#define PWM2PRH3                      739
#define PWM2PRH4                      740
#define PWM2PRH5                      741
#define PWM2PRH6                      742
#define PWM2PRH7                      743
#define PWM2OFL                       744
#define PWM2OFL_OF                    745
#define PWM2OFL0                      746
#define PWM2OFL1                      747
#define PWM2OFL2                      748
#define PWM2OFL3                      749
#define PWM2OFL4                      750
#define PWM2OFL5                      751
#define PWM2OFL6                      752
#define PWM2OFL7                      753
#define PWM2OFH                       754
#define PWM2OFH0                      755
#define PWM2OFH_OF                    756
#define PWM2OFH1                      757
#define PWM2OFH2                      758
#define PWM2OFH3                      759
#define PWM2OFH4                      760
#define PWM2OFH5                      761
#define PWM2OFH6                      762
#define PWM2OFH7                      763
#define PWM2TMRL_TMR                  764
#define PWM2TMRL0                     765
#define PWM2TMRL                      766
#define PWM2TMRL1                     767
#define PWM2TMRL2                     768
#define PWM2TMRL3                     769
#define PWM2TMRL4                     770
#define PWM2TMRL5                     771
#define PWM2TMRL6                     772
#define PWM2TMRL7                     773
#define PWM2TMRH_TMR                  774
#define PWM2TMRH                      775
#define PWM2TMRH0                     776
#define PWM2TMRH1                     777
#define PWM2TMRH2                     778
#define PWM2TMRH3                     779
#define PWM2TMRH4                     780
#define PWM2TMRH5                     781
#define PWM2TMRH6                     782
#define PWM2TMRH7                     783
#define PWM2CON                       784
#define PWM2MODE0                     785
#define PWM2MODE                      786
#define PWM2CON_MODE0                 787
#define PWM2CON_MODE                  788
#define PWM2MODE1                     789
#define PWM2CON_MODE1                 790
#define PWM2POL                       791
#define PWM2CON_POL                   792
#define PWM2CON_OUT                   793
#define PWM2OUT                       794
#define PWM2OE                        795
#define PWM2CON_OE                    796
#define PWM2EN                        797
#define PWM2CON_EN                    798
#define PWM2INTE                      799
#define PWM2INTE_PRIE                 800
#define PWM2PRIE                      801
#define PWM2INTE_DCIE                 802
#define PWM2DCIE                      803
#define PWM2INTE_PHIE                 804
#define PWM2PHIE                      805
#define PWM2INTE_OFIE                 806
#define PWM2OFIE                      807
#define PWM2INTF                      808
#define PWM2INTF_PRIF                 809
#define PWM2PRIF                      810
#define PWM2INTF_DCIF                 811
#define PWM2DCIF                      812
#define PWM2INTF_PHIF                 813
#define PWM2PHIF                      814
#define PWM2INTF_OFIF                 815
#define PWM2OFIF                      816
#define PWM2CLKCON                    817
#define PWM2CS0                       818
#define PWM2CS                        819
#define PWM2CLKCON_CS0                820
#define PWM2CLKCON_CS                 821
#define PWM2CLKCON_CS1                822
#define PWM2CS1                       823
#define PWM2CLKCON_PS                 824
#define PWM2CLKCON_PS0                825
#define PWM2PS0                       826
#define PWM2PS                        827
#define PWM2PS1                       828
#define PWM2CLKCON_PS1                829
#define PWM2PS2                       830
#define PWM2CLKCON_PS2                831
#define PWM2LDCON                     832
#define PWM2LDCON_LDS0                833
#define PWM2LDS0                      834
#define PWM2LDCON_LDS                 835
#define PWM2LDS                       836
#define PWM2LDS1                      837
#define PWM2LDCON_LDS1                838
#define PWM2LDM                       839
#define PWM2LDCON_LDT                 840
#define PWM2LD                        841
#define PWM2LDCON_LDA                 842
#define PWM2OFCON                     843
#define PWM2OFS                       844
#define PWM2OFS0                      845
#define PWM2OFCON_OFS0                846
#define PWM2OFCON_OFS                 847
#define PWM2OFCON_OFS1                848
#define PWM2OFS1                      849
#define PWM2OFMC                      850
#define PWM2OFCON_OFO                 851
#define PWM2OFCON_OFM0                852
#define PWM2OFM                       853
#define PWM2OFCON_OFM                 854
#define PWM2OFM0                      855
#define PWM2OFCON_OFM1                856
#define PWM2OFM1                      857
#define PWM3PHL                       858
#define PWM3PHL_PH                    859
#define PWM3PHL0                      860
#define PWM3PHL1                      861
#define PWM3PHL2                      862
#define PWM3PHL3                      863
#define PWM3PHL4                      864
#define PWM3PHL5                      865
#define PWM3PHL6                      866
#define PWM3PHL7                      867
#define PWM3PHH0                      868
#define PWM3PHH                       869
#define PWM3PHH_PH                    870
#define PWM3PHH1                      871
#define PWM3PHH2                      872
#define PWM3PHH3                      873
#define PWM3PHH4                      874
#define PWM3PHH5                      875
#define PWM3PHH6                      876
#define PWM3PHH7                      877
#define PWM3DCL_DC                    878
#define PWM3DCL0                      879
#define PWM3DCL                       880
#define PWM3DCL1                      881
#define PWM3DCL2                      882
#define PWM3DCL3                      883
#define PWM3DCL4                      884
#define PWM3DCL5                      885
#define PWM3DCL6                      886
#define PWM3DCL7                      887
#define PWM3DCH_DC                    888
#define PWM3DCH0                      889
#define PWM3DCH                       890
#define PWM3DCH1                      891
#define PWM3DCH2                      892
#define PWM3DCH3                      893
#define PWM3DCH4                      894
#define PWM3DCH5                      895
#define PWM3DCH6                      896
#define PWM3DCH7                      897
#define PWM3PRL0                      898
#define PWM3PRL                       899
#define PWM3PRL_PR                    900
#define PWM3PRL1                      901
#define PWM3PRL2                      902
#define PWM3PRL3                      903
#define PWM3PRL4                      904
#define PWM3PRL5                      905
#define PWM3PRL6                      906
#define PWM3PRL7                      907
#define PWM3PRH0                      908
#define PWM3PRH_PR                    909
#define PWM3PRH                       910
#define PWM3PRH1                      911
#define PWM3PRH2                      912
#define PWM3PRH3                      913
#define PWM3PRH4                      914
#define PWM3PRH5                      915
#define PWM3PRH6                      916
#define PWM3PRH7                      917
#define PWM3OFL_OF                    918
#define PWM3OFL0                      919
#define PWM3OFL                       920
#define PWM3OFL1                      921
#define PWM3OFL2                      922
#define PWM3OFL3                      923
#define PWM3OFL4                      924
#define PWM3OFL5                      925
#define PWM3OFL6                      926
#define PWM3OFL7                      927
#define PWM3OFH_OF                    928
#define PWM3OFH0                      929
#define PWM3OFH                       930
#define PWM3OFH1                      931
#define PWM3OFH2                      932
#define PWM3OFH3                      933
#define PWM3OFH4                      934
#define PWM3OFH5                      935
#define PWM3OFH6                      936
#define PWM3OFH7                      937
#define PWM3TMRL0                     938
#define PWM3TMRL                      939
#define PWM3TMRL_TMR                  940
#define PWM3TMRL1                     941
#define PWM3TMRL2                     942
#define PWM3TMRL3                     943
#define PWM3TMRL4                     944
#define PWM3TMRL5                     945
#define PWM3TMRL6                     946
#define PWM3TMRL7                     947
#define PWM3TMRH0                     948
#define PWM3TMRH_TMR                  949
#define PWM3TMRH                      950
#define PWM3TMRH1                     951
#define PWM3TMRH2                     952
#define PWM3TMRH3                     953
#define PWM3TMRH4                     954
#define PWM3TMRH5                     955
#define PWM3TMRH6                     956
#define PWM3TMRH7                     957
#define PWM3CON                       958
#define PWM3CON_MODE0                 959
#define PWM3MODE                      960
#define PWM3CON_MODE                  961
#define PWM3MODE0                     962
#define PWM3CON_MODE1                 963
#define PWM3MODE1                     964
#define PWM3CON_POL                   965
#define PWM3POL                       966
#define PWM3CON_OUT                   967
#define PWM3OUT                       968
#define PWM3OE                        969
#define PWM3CON_OE                    970
#define PWM3EN                        971
#define PWM3CON_EN                    972
#define PWM3INTE                      973
#define PWM3PRIE                      974
#define PWM3INTE_PRIE                 975
#define PWM3INTE_DCIE                 976
#define PWM3DCIE                      977
#define PWM3PHIE                      978
#define PWM3INTE_PHIE                 979
#define PWM3INTE_OFIE                 980
#define PWM3OFIE                      981
#define PWM3INTF                      982
#define PWM3PRIF                      983
#define PWM3INTF_PRIF                 984
#define PWM3INTF_DCIF                 985
#define PWM3DCIF                      986
#define PWM3INTF_PHIF                 987
#define PWM3PHIF                      988
#define PWM3INTF_OFIF                 989
#define PWM3OFIF                      990
#define PWM3CLKCON                    991
#define PWM3CLKCON_CS                 992
#define PWM3CS                        993
#define PWM3CS0                       994
#define PWM3CLKCON_CS0                995
#define PWM3CS1                       996
#define PWM3CLKCON_CS1                997
#define PWM3PS0                       998
#define PWM3CLKCON_PS                 999
#define PWM3CLKCON_PS0                1000
#define PWM3PS                        1001
#define PWM3PS1                       1002
#define PWM3CLKCON_PS1                1003
#define PWM3PS2                       1004
#define PWM3CLKCON_PS2                1005
#define PWM3LDCON                     1006
#define PWM3LDCON_LDS                 1007
#define PWM3LDS0                      1008
#define PWM3LDS                       1009
#define PWM3LDCON_LDS0                1010
#define PWM3LDS1                      1011
#define PWM3LDCON_LDS1                1012
#define PWM3LDCON_LDT                 1013
#define PWM3LDM                       1014
#define PWM3LDCON_LDA                 1015
#define PWM3LD                        1016
#define PWM3OFCON                     1017
#define PWM3OFS                       1018
#define PWM3OFCON_OFS0                1019
#define PWM3OFS0                      1020
#define PWM3OFCON_OFS                 1021
#define PWM3OFCON_OFS1                1022
#define PWM3OFS1                      1023
#define PWM3OFMC                      1024
#define PWM3OFCON_OFO                 1025
#define PWM3OFM0                      1026
#define PWM3OFCON_OFM0                1027
#define PWM3OFCON_OFM                 1028
#define PWM3OFM                       1029
#define PWM3OFM1                      1030
#define PWM3OFCON_OFM1                1031
#define PWM4PHL_PH                    1032
#define PWM4PHL                       1033
#define PWM4PHL0                      1034
#define PWM4PHL1                      1035
#define PWM4PHL2                      1036
#define PWM4PHL3                      1037
#define PWM4PHL4                      1038
#define PWM4PHL5                      1039
#define PWM4PHL6                      1040
#define PWM4PHL7                      1041
#define PWM4PHH                       1042
#define PWM4PHH0                      1043
#define PWM4PHH_PH                    1044
#define PWM4PHH1                      1045
#define PWM4PHH2                      1046
#define PWM4PHH3                      1047
#define PWM4PHH4                      1048
#define PWM4PHH5                      1049
#define PWM4PHH6                      1050
#define PWM4PHH7                      1051
#define PWM4DCL0                      1052
#define PWM4DCL                       1053
#define PWM4DCL_DC                    1054
#define PWM4DCL1                      1055
#define PWM4DCL2                      1056
#define PWM4DCL3                      1057
#define PWM4DCL4                      1058
#define PWM4DCL5                      1059
#define PWM4DCL6                      1060
#define PWM4DCL7                      1061
#define PWM4DCH0                      1062
#define PWM4DCH                       1063
#define PWM4DCH_DC                    1064
#define PWM4DCH1                      1065
#define PWM4DCH2                      1066
#define PWM4DCH3                      1067
#define PWM4DCH4                      1068
#define PWM4DCH5                      1069
#define PWM4DCH6                      1070
#define PWM4DCH7                      1071
#define PWM4PRL_PR                    1072
#define PWM4PRL                       1073
#define PWM4PRL0                      1074
#define PWM4PRL1                      1075
#define PWM4PRL2                      1076
#define PWM4PRL3                      1077
#define PWM4PRL4                      1078
#define PWM4PRL5                      1079
#define PWM4PRL6                      1080
#define PWM4PRL7                      1081
#define PWM4PRH0                      1082
#define PWM4PRH                       1083
#define PWM4PRH_PR                    1084
#define PWM4PRH1                      1085
#define PWM4PRH2                      1086
#define PWM4PRH3                      1087
#define PWM4PRH4                      1088
#define PWM4PRH5                      1089
#define PWM4PRH6                      1090
