tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1575_tdd.h
#define PWM4PRH7                      1091
#define PWM4OFL0                      1092
#define PWM4OFL                       1093
#define PWM4OFL_OF                    1094
#define PWM4OFL1                      1095
#define PWM4OFL2                      1096
#define PWM4OFL3                      1097
#define PWM4OFL4                      1098
#define PWM4OFL5                      1099
#define PWM4OFL6                      1100
#define PWM4OFL7                      1101
#define PWM4OFH                       1102
#define PWM4OFH_OF                    1103
#define PWM4OFH0                      1104
#define PWM4OFH1                      1105
#define PWM4OFH2                      1106
#define PWM4OFH3                      1107
#define PWM4OFH4                      1108
#define PWM4OFH5                      1109
#define PWM4OFH6                      1110
#define PWM4OFH7                      1111
#define PWM4TMRL0                     1112
#define PWM4TMRL_TMR                  1113
#define PWM4TMRL                      1114
#define PWM4TMRL1                     1115
#define PWM4TMRL2                     1116
#define PWM4TMRL3                     1117
#define PWM4TMRL4                     1118
#define PWM4TMRL5                     1119
#define PWM4TMRL6                     1120
#define PWM4TMRL7                     1121
#define PWM4TMRH                      1122
#define PWM4TMRH_TMR                  1123
#define PWM4TMRH0                     1124
#define PWM4TMRH1                     1125
#define PWM4TMRH2                     1126
#define PWM4TMRH3                     1127
#define PWM4TMRH4                     1128
#define PWM4TMRH5                     1129
#define PWM4TMRH6                     1130
#define PWM4TMRH7                     1131
#define PWM4CON                       1132
#define PWM4MODE                      1133
#define PWM4MODE0                     1134
#define PWM4CON_MODE                  1135
#define PWM4CON_MODE0                 1136
#define PWM4CON_MODE1                 1137
#define PWM4MODE1                     1138
#define PWM4POL                       1139
#define PWM4CON_POL                   1140
#define PWM4CON_OUT                   1141
#define PWM4OUT                       1142
#define PWM4CON_OE                    1143
#define PWM4OE                        1144
#define PWM4EN                        1145
#define PWM4CON_EN                    1146
#define PWM4INTE                      1147
#define PWM4INTE_PRIE                 1148
#define PWM4PRIE                      1149
#define PWM4INTE_DCIE                 1150
#define PWM4DCIE                      1151
#define PWM4PHIE                      1152
#define PWM4INTE_PHIE                 1153
#define PWM4OFIE                      1154
#define PWM4INTE_OFIE                 1155
#define PWM4INTF                      1156
#define PWM4PRIF                      1157
#define PWM4INTF_PRIF                 1158
#define PWM4INTF_DCIF                 1159
#define PWM4DCIF                      1160
#define PWM4PHIF                      1161
#define PWM4INTF_PHIF                 1162
#define PWM4OFIF                      1163
#define PWM4INTF_OFIF                 1164
#define PWM4CLKCON                    1165
#define PWM4CLKCON_CS0                1166
#define PWM4CS                        1167
#define PWM4CLKCON_CS                 1168
#define PWM4CS0                       1169
#define PWM4CLKCON_CS1                1170
#define PWM4CS1                       1171
#define PWM4PS0                       1172
#define PWM4CLKCON_PS0                1173
#define PWM4CLKCON_PS                 1174
#define PWM4PS                        1175
#define PWM4PS1                       1176
#define PWM4CLKCON_PS1                1177
#define PWM4PS2                       1178
#define PWM4CLKCON_PS2                1179
#define PWM4LDCON                     1180
#define PWM4LDS                       1181
#define PWM4LDCON_LDS0                1182
#define PWM4LDCON_LDS                 1183
#define PWM4LDS0                      1184
#define PWM4LDCON_LDS1                1185
#define PWM4LDS1                      1186
#define PWM4LDM                       1187
#define PWM4LDCON_LDT                 1188
#define PWM4LDCON_LDA                 1189
#define PWM4LD                        1190
#define PWM4OFCON                     1191
#define PWM4OFCON_OFS                 1192
#define PWM4OFS                       1193
#define PWM4OFCON_OFS0                1194
#define PWM4OFS0                      1195
#define PWM4OFCON_OFS1                1196
#define PWM4OFS1                      1197
#define PWM4OFMC                      1198
#define PWM4OFCON_OFO                 1199
#define PWM4OFM0                      1200
#define PWM4OFM                       1201
#define PWM4OFCON_OFM0                1202
#define PWM4OFCON_OFM                 1203
#define PWM4OFM1                      1204
#define PWM4OFCON_OFM1                1205
#define PPSLOCK                       1206
#define PPSLOCKED                     1207
#define INTPPS0                       1208
#define INTPPS                        1209
#define INTPPS1                       1210
#define INTPPS2                       1211
#define INTPPS3                       1212
#define INTPPS4                       1213
#define T0CKIPPS0                     1214
#define T0CKIPPS                      1215
#define T0CKIPPS1                     1216
#define T0CKIPPS2                     1217
#define T0CKIPPS3                     1218
#define T0CKIPPS4                     1219
#define T1CKIPPS0                     1220
#define T1CKIPPS                      1221
#define T1CKIPPS1                     1222
#define T1CKIPPS2                     1223
#define T1CKIPPS3                     1224
#define T1CKIPPS4                     1225
#define T1GPPS0                       1226
#define T1GPPS                        1227
#define T1GPPS1                       1228
#define T1GPPS2                       1229
#define T1GPPS3                       1230
#define T1GPPS4                       1231
#define CWG1INPPS0                    1232
#define CWG1INPPS                     1233
#define CWG1INPPS1                    1234
#define CWG1INPPS2                    1235
#define CWG1INPPS3                    1236
#define CWG1INPPS4                    1237
#define RXPPS0                        1238
#define RXPPS                         1239
#define RXPPS1                        1240
#define RXPPS2                        1241
#define RXPPS3                        1242
#define RXPPS4                        1243
#define CKPPS                         1244
#define CKPPS0                        1245
#define CKPPS1                        1246
#define CKPPS2                        1247
#define CKPPS3                        1248
#define CKPPS4                        1249
#define ADCACTPPS0                    1250
#define ADCACTPPS                     1251
#define ADCACTPPS1                    1252
#define ADCACTPPS2                    1253
#define ADCACTPPS3                    1254
#define ADCACTPPS4                    1255
#define RA0PPS                        1256
#define RA0PPS0                       1257
#define RA0PPS1                       1258
#define RA0PPS2                       1259
#define RA0PPS3                       1260
#define RA1PPS                        1261
#define RA1PPS0                       1262
#define RA1PPS1                       1263
#define RA1PPS2                       1264
#define RA1PPS3                       1265
#define RA2PPS                        1266
#define RA2PPS0                       1267
#define RA2PPS1                       1268
#define RA2PPS2                       1269
#define RA2PPS3                       1270
#define RA4PPS                        1271
#define RA4PPS0                       1272
#define RA4PPS1                       1273
#define RA4PPS2                       1274
#define RA4PPS3                       1275
#define RA5PPS                        1276
#define RA5PPS0                       1277
#define RA5PPS1                       1278
#define RA5PPS2                       1279
#define RA5PPS3                       1280
#define RC0PPS                        1281
#define RC0PPS0                       1282
#define RC0PPS1                       1283
#define RC0PPS2                       1284
#define RC0PPS3                       1285
#define RC1PPS_RC1PPS0                1286
#define RC1PPS                        1287
#define RC1PPS_RC1PPS1                1288
#define RC1PPS_RC1PPS2                1289
#define RC1PPS_RC1PPS3                1290
#define RC2PPS_RC1PPS0                1291
#define RC2PPS                        1292
#define RC2PPS_RC1PPS1                1293
#define RC2PPS_RC1PPS2                1294
#define RC2PPS_RC1PPS3                1295
#define RC3PPS                        1296
#define RC3PPS0                       1297
#define RC3PPS1                       1298
#define RC3PPS2                       1299
#define RC3PPS3                       1300
#define RC4PPS0                       1301
#define RC4PPS                        1302
#define RC4PPS1                       1303
#define RC4PPS2                       1304
#define RC4PPS3                       1305
#define RC5PPS0                       1306
#define RC5PPS                        1307
#define RC5PPS1                       1308
#define RC5PPS2                       1309
#define RC5PPS3                       1310
#define STATUS_SHAD                   1311
#define C_SHAD                        1312
#define DC_SHAD                       1313
#define Z_SHAD                        1314
#define WREG_SHAD                     1315
#define BSR_SHAD                      1316
#define PCLATH_SHAD                   1317
#define FSR0L_SHAD                    1318
#define FSR0H_SHAD                    1319
#define FSR1L_SHAD                    1320
#define FSR1H_SHAD                    1321
#define STKPTR                        1322
#define TOSL                          1323
#define TOSH                          1324

#endif // _PIC16LF1575_H_
